GodoSanchezH/dsPIC_Umaker_Enero/Ejemplos/prueba.X/mcc_generated_files/adc1.h
    return status;
}

/**
  @Summary
    Enables interrupts.

  @Description
    This routine is used to enable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptEnable(); 
    </code>
*/
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
  @Summary
    Disables interrupts.

  @Description
    This routine is used to disable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptDisable(); 
    </code>
*/
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
  @Summary
    Clears interrupt flag

  @Description
    This routine is used to clear the interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptFlagClear(); 
    </code>
*/
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
  @Summary
    Allows selection of priority for interrupt.

  @Description
    This routine is used to select desired priority for interrupt.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        uint16_t priorityValue;
        priorityValue = 0x002;
 
        ADC1_InterruptPrioritySet(priorityValue); 
    </code>
*/
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = 0x7 & priorityValue;
}

/**
  @Summary
    ADC1 Common callback routine.

  @Description
    This routine is a ADC1 Common callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a ADC1 Common callback address.

  @Description
    This routine assigns a function pointer with a ADC1 Common callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_SetCommonInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_Tasks();
    </code>
*/
void ADC1_Tasks(void);

/**
  @Summary
    Enables individual channel interrupt.

  @Description
    This routine is used to enable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptEnable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptEnable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case channel_AN0:
                IEC5bits.ADCAN0IE = 1;
                break;
        case channel_AN9:
                IEC6bits.ADCAN9IE = 1;
                break;
        case channel_AN16:
                IEC6bits.ADCAN16IE = 1;
                break;
        case channel_AN17:
                IEC6bits.ADCAN17IE = 1;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Disables individual channel interrupt.

  @Description
    This routine is used to disable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptDisable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptDisable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case channel_AN0:
                IEC5bits.ADCAN0IE = 0;
                break;
        case channel_AN9:
                IEC6bits.ADCAN9IE = 0;
                break;
        case channel_AN16:
                IEC6bits.ADCAN16IE = 0;
                break;
        case channel_AN17:
                IEC6bits.ADCAN17IE = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Clears individual channel interrupt flag

  @Description
    This routine is used to clear the individual channel interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptFlagClear(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptFlagClear(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case channel_AN0:
                IFS5bits.ADCAN0IF = 0;
                break;
        case channel_AN9:
                IFS6bits.ADCAN9IF = 0;
                break;
        case channel_AN16:
                IFS6bits.ADCAN16IF = 0;
                break;
        case channel_AN17:
                IFS6bits.ADCAN17IF = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    ADC1 channel_AN0 callback routine.

  @Description
    This routine is a ADC1 channel_AN0 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN0InterruptHandler(&ADC1_channel_AN0_CallBack);
    </code>
*/
void ADC1_channel_AN0_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN0 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN0 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN0InterruptHandler(&ADC1_channel_AN0_CallBack);
    </code>
*/
void ADC1_Setchannel_AN0InterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 channel_AN0 polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_channel_AN0_Tasks();
    </code>
*/
void ADC1_channel_AN0_Tasks(void);

/**
  @Summary
    ADC1 channel_AN9 callback routine.

  @Description
    This routine is a ADC1 channel_AN9 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN9InterruptHandler(&ADC1_channel_AN9_CallBack);
    </code>
*/
void ADC1_channel_AN9_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN9 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN9 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN9InterruptHandler(&ADC1_channel_AN9_CallBack);
    </code>
*/
void ADC1_Setchannel_AN9InterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 channel_AN9 polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_channel_AN9_Tasks();
    </code>
*/
void ADC1_channel_AN9_Tasks(void);

/**
  @Summary
    ADC1 channel_AN16 callback routine.

  @Description
    This routine is a ADC1 channel_AN16 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN16InterruptHandler(&ADC1_channel_AN16_CallBack);
    </code>
*/
void ADC1_channel_AN16_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN16 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN16 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN16InterruptHandler(&ADC1_channel_AN16_CallBack);
    </code>
*/
void ADC1_Setchannel_AN16InterruptHandler(void* handler);

/**
  @Summary
    ADC1 channel_AN17 callback routine.

  @Description
    This routine is a ADC1 channel_AN17 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN17InterruptHandler(&ADC1_channel_AN17_CallBack);
    </code>
*/
void ADC1_channel_AN17_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN17 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN17 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN17InterruptHandler(&ADC1_channel_AN17_CallBack);
    </code>
*/
void ADC1_Setchannel_AN17InterruptHandler(void* handler);





/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);



